README.md
```mermaid
graph BT
  linkStyle default fill:#ffffff

  subgraph diagram ["Photo_platform - API Gateway - Components"]
    style diagram fill:#ffffff,stroke:#ffffff

    3("<div style='font-weight: bold'>UI платформы</div><div style='font-size: 70%; margin-top: 0px'>[Container]</div>")
    style 3 fill:#438dd5,stroke:#2e6295,color:#ffffff
    16("<div style='font-weight: bold'>MinIO</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Внешнее хранилище,<br />совместимое с протоколом S3.</div>")
    style 16 fill:#1168bd,stroke:#0b4884,color:#ffffff

    subgraph 6 ["API Gateway"]
      style 6 fill:#ffffff,stroke:#2e6295,color:#2e6295

      10("<div style='font-weight: bold'>Like Service</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div>")
      style 10 fill:#85bbf0,stroke:#5d82a8,color:#000000
      11("<div style='font-weight: bold'>Friend Service</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div>")
      style 11 fill:#85bbf0,stroke:#5d82a8,color:#000000
      12("<div style='font-weight: bold'>Redis Cache</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div><div style='font-size: 80%; margin-top:10px'>Служит для кэширования<br />данных.</div>")
      style 12 fill:#85bbf0,stroke:#5d82a8,color:#000000
      7("<div style='font-weight: bold'>Auth Service</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div>")
      style 7 fill:#85bbf0,stroke:#5d82a8,color:#000000
      8("<div style='font-weight: bold'>User Profile Service</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div>")
      style 8 fill:#85bbf0,stroke:#5d82a8,color:#000000
      9("<div style='font-weight: bold'>Photo Service</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div>")
      style 9 fill:#85bbf0,stroke:#5d82a8,color:#000000
    end

    16-. "<div>Предоставляет фотографии</div><div style='font-size: 70%'></div>" .->3
    3-. "<div>Запрос на получение<br />пользователя</div><div style='font-size: 70%'></div>" .->7
    7-. "<div>Получение и обновления<br />информации о пользователе</div><div style='font-size: 70%'></div>" .->8
    8-. "<div>Получение информации о<br />фотографиях пользователя</div><div style='font-size: 70%'></div>" .->9
    3-. "<div>Запрос на отображение фото</div><div style='font-size: 70%'></div>" .->9
    9-. "<div>Отображение фотографий</div><div style='font-size: 70%'></div>" .->3
    9-. "<div>Загружает фотографии в<br />хранилище</div><div style='font-size: 70%'></div>" .->16
    9-. "<div>Получает данные о<br />пользователе, который<br />загружает фотографию</div><div style='font-size: 70%'></div>" .->8
    10-. "<div>Получение данных о фотографии</div><div style='font-size: 70%'></div>" .->9
    10-. "<div>Проверка, является ли<br />владелец фотографии другом</div><div style='font-size: 70%'></div>" .->11
    10-. "<div>Получение данных о<br />пользователе, который ставит<br />лайк</div><div style='font-size: 70%'></div>" .->8
    3-. "<div>Запрос на добавление лайка</div><div style='font-size: 70%'></div>" .->10
    3-. "<div>Запрос на управление друзьями</div><div style='font-size: 70%'></div>" .->11
    11-. "<div>Получение и обновление данных<br />о друзьях</div><div style='font-size: 70%'></div>" .->8
    8-. "<div>Кэширование информации о<br />пользователе</div><div style='font-size: 70%'></div>" .->12
    9-. "<div>Кэширование фотографий</div><div style='font-size: 70%'></div>" .->12
    10-. "<div>Кэширование данных о лайках</div><div style='font-size: 70%'></div>" .->12
  end
```
